zhouhonglin428-demo/STM32F407_Refactored_Codebase/DMA_M TO P/User/usart/bsp_usart.h
#ifndef _BSP_USART_H
#define _BSP_USART_H

#include "stm32f4xx.h"
#include <stdio.h>

//引脚定义
#define DEBUG_USART							USART1

/*
不同串口挂载的时钟总线不一样，所以使能时钟也不一样
串口1跟6是  			RCC_APB2PeriphClockCmd
串口2，3，4，5是 	RCC_APB1 PeriphClockCmd
*/

#define DEBUG_USART                             USART1
#define DEBUG_USART_CLK                         RCC_APB2Periph_USART1
#define DEBUG_USART_BAUDRATE                    115200  //串口波特率

#define DEBUG_USART_RX_GPIO_PORT                GPIOA
#define DEBUG_USART_RX_GPIO_CLK                 RCC_AHB1Periph_GPIOA
#define DEBUG_USART_RX_PIN                      GPIO_Pin_10
#define DEBUG_USART_RX_AF                       GPIO_AF_USART1
#define DEBUG_USART_RX_SOURCE                   GPIO_PinSource10

#define DEBUG_USART_TX_GPIO_PORT                GPIOA
#define DEBUG_USART_TX_GPIO_CLK                 RCC_AHB1Periph_GPIOA
#define DEBUG_USART_TX_PIN                      GPIO_Pin_9
#define DEBUG_USART_TX_AF                       GPIO_AF_USART1
#define DEBUG_USART_TX_SOURCE                   GPIO_PinSource9

//#define DEBUG_USART_IRQHandler                  USART1_IRQHandler
//#define DEBUG_USART_IRQ                 		USART1_IRQn

//DMA
#define DEBUG_USART_DR_BASE               (USART1_BASE+0x04)		
#define SENDBUFF_SIZE                     5000				//发送的数据量
#define DEBUG_USART_DMA_CLK               RCC_AHB1Periph_DMA2	
#define DEBUG_USART_DMA_CHANNEL           DMA_Channel_4
#define DEBUG_USART_DMA_STREAM            DMA2_Stream7

void Debug_USART_Config(void);

void Usart_SendByte( USART_TypeDef * pUSARTx, uint8_t ch);

void USsart_SendString(USART_TypeDef* pUSARTx, char *str);

void DMA_Config(void);





#endif  /* _BSP_USART_H */

